modules/core-packages.org
#+TITLE: Core Packages Module
#+AUTHOR: Chris
#+DESCRIPTION: Essential packages for development
#+STARTUP: overview

* Core Development Packages

** Essential Packages
#+BEGIN_SRC emacs-lisp
;; Projectile for project management
(unless (package-installed-p 'projectile)
  (package-install 'projectile))

(require 'projectile)
(projectile-mode +1)

;; Vertico ecosystem - modern completion
(unless (package-installed-p 'vertico)
  (package-install 'vertico))

(unless (package-installed-p 'consult)
  (package-install 'consult))

(unless (package-installed-p 'marginalia)
  (package-install 'marginalia))

(unless (package-installed-p 'orderless)
  (package-install 'orderless))

;; Load and configure
(require 'vertico)
(require 'consult)
(require 'marginalia)
(require 'orderless)

(vertico-mode 1)
(marginalia-mode 1)

(setq completion-styles '(orderless basic)
      completion-category-defaults nil
      completion-category-overrides '((file (styles partial-completion))))

;; Enhanced keybindings - only if functions exist
(when (fboundp 'consult-M-x)
  (global-set-key (kbd "M-x") 'consult-M-x))

(when (fboundp 'consult-buffer)
  (global-set-key (kbd "C-x b") 'consult-buffer))

(when (fboundp 'consult-recent-file)
  (global-set-key (kbd "C-x C-r") 'consult-recent-file))

(when (fboundp 'consult-line)
  (global-set-key (kbd "C-s") 'consult-line))

;; Fallback keybindings if consult isn't available
(unless (fboundp 'consult-recent-file)
  (global-set-key (kbd "C-x C-r") 'recentf-open-files))

(unless (fboundp 'consult-buffer)
  (global-set-key (kbd "C-x b") 'switch-to-buffer))

;; Debug: Show what's actually bound
(message "C-x C-r bound to: %s" (key-binding (kbd "C-x C-r")))
(message "C-x b bound to: %s" (key-binding (kbd "C-x b")))

;; Eglot for LSP
(require 'eglot)
(add-to-list 'eglot-server-programs '(c-mode . ("clangd")))
(add-hook 'c-mode-hook 'eglot-ensure)
#+END_SRC

** Module Test
#+BEGIN_SRC emacs-lisp
(defun test-core-packages-module ()
  "Test core packages module functionality."
  (interactive)
  (let ((results '()))

    ;; Test package availability
    (dolist (pkg '(projectile vertico consult marginalia orderless))
      (if (featurep pkg)
          (push (format "%s: LOADED" pkg) results)
        (push (format "%s: NOT LOADED" pkg) results)))

    ;; Test key bindings
    (dolist (key '("M-x" "C-x b" "C-s"))
      (let ((binding (key-binding (kbd key))))
        (push (format "%s -> %s" key binding) results)))

    ;; Display results
    (with-current-buffer (get-buffer-create "*Core Packages Test*")
      (erase-buffer)
      (insert "=== Core Packages Module Test ===\n\n")
      (dolist (result (reverse results))
        (insert (format "%s\n" result)))
      (display-buffer (current-buffer)))

    (message "Core packages test completed")))
#+END_SRC